`timescale 1ns/1ns
module					key_delet_tb;
//系统相关
reg						clk;	//系统时钟，默认mhz
reg						rst_n;	//系统复位，低电平有效
initial					begin
						clk   =   0;
						rst_n =   0;
						#53  rst_n =   1;

end
always 					#10  clk=~clk;
//独立按键检测电平输入
reg						s_i;	//独立按键检测电平，低电平按下，有抖动
initial					begin						
						
						//模拟按键被按下一次，按下或者抬起有抖动
						s_i=1;
						#500			;//上电等待500ns
						s_i=			0;//按键按下
						#1000 s_i=		1;//抖动
						#200  s_i=		0;//抖动
						
						#   15_000_000	;//延迟15ms
						s_i=			0;
						
						
						#   50_000_000	;//稳定按下50ms
						s_i=			1;//按键抬起
						#1000 s_i=		0;//抖动
						#200  s_i=		1;//抖动
						
						
						#   15_000_000	;//延迟15ms
						s_i=			1;//稳定抬起
						#	200			 ;//仿真延迟200ns
						//////////////////////////////////////////
end
//独立按键检测电平输出
wire					s_o;	//独立按键检测电平，低电平按下，无抖动
key_delet				key_delet_ins
(
						//系统相关
						.clk(clk),	//系统时钟，默认mhz
						.rst_n(rst_n),	//系统复位，低电平有效
						//独立按键检测电平输入
						.s_i(s_i),	//独立按键检测电平，低电平按下，有抖动
						//独立按键检测电平输出
						.s_o(s_o)	//独立按键检测电平，低电平按下，无抖动

);
endmodule 