`timescale          1ns/1ns
module			    sub_tb;


//减法器参数输入

reg[7:0]			a;	//加法器参数a[7:0]

reg[7:0]			b;	//加法器参数b[7:0]

reg[7:0]			c;	//加法器参数c[7:0]
initial				begin
					#200      	;
					a=   		5;
					b=			8;
					c=			2;
					
					#200      	;
					a=   		50;
					b=			100;
					c=			30;

					#200      	;
					a=   		60;
					b=			90;
					c=			10;	

					#200      	;
					
					

end
//减法器输出结果
wire[7:0]			y;	//减法器运算结果输出

sub				sub_ins
(
				//减法器参数输入
				.a(a),	//加法器参数a[7:0]
				.b(b),	//加法器参数b[7:0]
				.c(c),	//加法器参数c[7:0]
				//减法器输出结果
				.y(y)	//减法器运算结果输出
);
endmodule 